results/raw/interzone/cilium-interzone-apachebench_400K_200_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.6 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.6
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      250
Time taken for tests:   9.556 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      85400000 bytes
HTML transferred:       61200000 bytes
Requests per second:    10464.78 [#/sec] (mean)
Time per request:       23.890 [ms] (mean)
Time per request:       0.096 [ms] (mean, across all concurrent requests)
Transfer rate:          8727.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1   10   1.6      9      21
Processing:     1   14   2.4     14      30
Waiting:        1   11   2.2     11      27
Total:          5   24   2.8     24      43

Percentage of the requests served within a certain time (ms)
  50%     24
  66%     25
  75%     26
  80%     26
  90%     27
  95%     28
  98%     30
  99%     31
 100%     43 (longest request)